# Пользователь вводит месяц в виде целого числа от 1 до 12. Сообщить к какому времени года
# относится месяц (зима, весна, лето, осень). Напишите решения через list и через dict.

month = int(input("Введите порядковый номер месяца: "))

#Вариант со списком
seasons = ["Зима", "Зима", "Весна", "Весна", "Весна", "Лето", "Лето", "Лето", "Осень", "Осень", "Осень", "Зима"]
print(seasons[month-1])

#Вариант со словарем 1
seasons_dict = {1:"Зима", 2:"Зима", 3:"Весна", 4:"Весна", 5:"Весна", 6:"Лето", 7:"Лето", 8:"Лето", 9:"Осень", 10:"Осень", 11:"Осень", 12:"Зима"}
print(seasons_dict.get(month))

#Вариант со словарем 2
seasons_dict_new = {"Зима":[1,2,12], "Весна":[3,4,5], "Лето":[6,7,8], "Осень":[9,10,11]}
for key, value in seasons_dict_new.items():
    if month in value:
        print(key)